/* No comment provided by engineer. */
"Check Wi-Fi connection and try again later." = "Check Wi-Fi connection and try again later.";

/* No comment provided by engineer. */
"Font Download failed." = "Font Download failed.";

